-- Включаем PostGIS
CREATE EXTENSION IF NOT EXISTS postgis;

-- Таблица достопримечательностей
CREATE TABLE sight (
    id BIGSERIAL PRIMARY KEY,
    name TEXT UNIQUE NOT NULL,
    city TEXT NOT NULL,
    position GEOGRAPHY(Point, 4326) NOT NULL,
    category TEXT NOT NULL
);

-- Индекс для геопоиска
CREATE INDEX idx_sight_position ON sight USING GIST (position);

-- Таблица отзывов
CREATE TABLE feedback (
    id BIGSERIAL PRIMARY KEY,
    sight_id BIGINT NOT NULL REFERENCES sight(id) ON DELETE CASCADE,
    username TEXT NOT NULL,
    text TEXT,
    estimation INT NOT NULL CHECK (estimation BETWEEN 1 AND 5)
);
-- Вставка данных в sight для работы
INSERT INTO sight (name, city, position, category) VALUES
('Памятник И.С.Тургенев (Ульяновск)', 'Ульяновск', ST_GeogFromText('SRID=4326;POINT(48.39124258388574 54.392885341540904)'), 'Памятник'),
('Парк им. Тургенев (Москва)', 'Москва', ST_GeogFromText('SRID=4326;POINT(37.819206245689124 55.7733654416235)'), 'Парк'),
('Музей им. Толстой (Самара)', 'Самара', ST_GeogFromText('SRID=4326;POINT(50.15319004172481 53.15875463322275)'), 'Музей'),
('Парк им. Достоевский (Санкт-Петербург)', 'Санкт-Петербург', ST_GeogFromText('SRID=4326;POINT(30.435732311245534 60.00654121893692)'), 'Парк'),
('Театр им. Тургенев (Уфа)', 'Уфа', ST_GeogFromText('SRID=4326;POINT(55.87917189451065 54.69558555352201)'), 'Театр'),
('Парк им. Циолковский (Ульяновск)', 'Ульяновск', ST_GeogFromText('SRID=4326;POINT(48.48126846792161 54.24519282707871)'), 'Парк'),
('Театр им. Ломоносов (Москва)', 'Москва', ST_GeogFromText('SRID=4326;POINT(37.52114531287718 55.54060847902163)'), 'Театр'),
('Музей им. Менделеев (Самара)', 'Самара', ST_GeogFromText('SRID=4326;POINT(50.0185257020256 53.16439487811523)'), 'Музей'),
('Музей им. Менделеев (Уфа)', 'Уфа', ST_GeogFromText('SRID=4326;POINT(56.16819172408354 54.60557027185048)'), 'Музей'),
('Памятник К.Э.Циолковский (Уфа)', 'Уфа', ST_GeogFromText('SRID=4326;POINT(56.04189144334649 54.76047809437651)'), 'Памятник'),
('Театр им. Пушкин (Уфа)', 'Уфа', ST_GeogFromText('SRID=4326;POINT(55.819989001118444 54.75952175943633)'), 'Театр'),
('Театр им. Гагарин (Москва)', 'Москва', ST_GeogFromText('SRID=4326;POINT(37.72600716236293 55.52168723248594)'), 'Театр'),
('Парк им. Толстой (Санкт-Петербург)', 'Санкт-Петербург', ST_GeogFromText('SRID=4326;POINT(30.10984834306804 60.08238381440871)'), 'Парк'),
('Музей им. Ломоносов (Уфа)', 'Уфа', ST_GeogFromText('SRID=4326;POINT(55.821837319667374 54.73901956447472)'), 'Музей'),
('Памятник Д.Ж.Пупин (Самара)', 'Самара', ST_GeogFromText('SRID=4326;POINT(50.15671391217867 53.183197716189454)'), 'Памятник'),
('Парк им. Тургенев (Уфа)', 'Уфа', ST_GeogFromText('SRID=4326;POINT(56.190787723188656 54.66665645867529)'), 'Парк'),
('Музей им. Толстой 2 (Самара)', 'Самара', ST_GeogFromText('SRID=4326;POINT(50.17712263999368 53.157054663731216)'), 'Музей'),
('Музей им. Тургенев (Москва)', 'Москва', ST_GeogFromText('SRID=4326;POINT(37.338214491365875 55.52299365762917)'), 'Музей'),
('Театр им. Достоевский (Казань)', 'Казань', ST_GeogFromText('SRID=4326;POINT(49.007254430363304 55.786603086922355)'), 'Театр'),
('Парк им. Пушкин (Ульяновск)', 'Ульяновск', ST_GeogFromText('SRID=4326;POINT(48.462459820528565 54.24126746702863)'), 'Парк'),
('Театр им. Циолковский (Ульяновск)', 'Ульяновск', ST_GeogFromText('SRID=4326;POINT(48.34571986325773 54.33577196849459)'), 'Театр'),
('Театр им. Ломоносов 2 (Москва)', 'Москва', ST_GeogFromText('SRID=4326;POINT(37.5021753437188 55.59992629644145)'), 'Театр'),
('Парк им. Чайковский (Москва)', 'Москва', ST_GeogFromText('SRID=4326;POINT(37.630733327508935 55.773597490044324)'), 'Парк'),
('Парк им. Чайковский (Казань)', 'Казань', ST_GeogFromText('SRID=4326;POINT(49.2623608613259 55.865471558494114)'), 'Парк'),
('Музей им. Циолковский (Ульяновск)', 'Ульяновск', ST_GeogFromText('SRID=4326;POINT(48.367143604482116 54.328786463900734)'), 'Музей'),
('Музей им. Пушкин (Москва)', 'Москва', ST_GeogFromText('SRID=4326;POINT(37.83310981268151 55.625380281846766)'), 'Музей'),
('Парк им. Ломоносов (Москва)', 'Москва', ST_GeogFromText('SRID=4326;POINT(37.30125534495968 55.6083572920212)'), 'Парк'),
('Музей им. Достоевский (Ульяновск)', 'Ульяновск', ST_GeogFromText('SRID=4326;POINT(48.41157230650766 54.30977105620802)'), 'Музей'),
('Парк им. Менделеев (Самара)', 'Самара', ST_GeogFromText('SRID=4326;POINT(50.043006435578704 53.13779370294597)'), 'Парк'),
('Музей им. Менделеев (Москва)', 'Москва', ST_GeogFromText('SRID=4326;POINT(37.51928767054333 55.65615383258179)'), 'Музей');